БИТУправление_медицинским_центром_демо/src/Documents/бит_СписокОбзвона/бит_СписокОбзвона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>бит_СписокОбзвона</name>
  <posting>Deny</posting>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанПолностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обработан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/бит_СписокОбзвона/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	Если Объект.Ссылка.Пустая() И Параметры.Свойство("СписокКлиентов") Тогда
		ЗаполнитьСписок(Параметры.СписокКлиентов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		строка = Объект.Список.Добавить();
		строка.Контрагент = ВыбранноеЗначение;
		строка.НомерТелефона = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(строка.Контрагент);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрагентПриИзменении(Элемент)
	Элементы.Список.ТекущиеДанные.НомерТелефона = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Элементы.Список.ТекущиеДанные.Контрагент);
	Элементы.Список.ТекущиеДанные.Обработан = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокНомерТелефонаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Контрагент) Тогда
		массивНомераТелефонов = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Элементы.Список.ТекущиеДанные.Контрагент, , , Ложь);
		Элемент.СписокВыбора.ЗагрузитьЗначения(массивНомераТелефонов);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОчиститьФлагОбработки(Команда)
	Для Каждого строкаСписка Из Объект.Список Цикл
		Если строкаСписка.Обработан Тогда
			строкаСписка.Обработан = Ложь;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРасписанию(Команда)
	
	СписокКлиентов = ОткрытьФормуМодально("Документ.бит_СписокОбзвона.Форма.ЗаполнениеПоРасписанию",Новый Структура("Филиал", Объект.Филиал));
	Если СписокКлиентов <> Неопределено Тогда
		Для Каждого СтрокаСписка Из СписокКлиентов Цикл
			
			СуществующиеЗначения = Объект.Список.НайтиСтроки(Новый Структура("Контрагент", СтрокаСписка.Контрагент));
			Если СуществующиеЗначения.Количество() = 0 Тогда
			
				НоваяСтрока = Объект.Список.Добавить();
				НоваяСтрока.Контрагент	  = СтрокаСписка.Контрагент;
				НоваяСтрока.НомерТелефона = КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(СтрокаСписка.НомерТелефона, Ложь);
				
			КонецЕсли;
				
		КонецЦикла;
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписок(СписокКлиентов)
	
	Для Каждого Клиент Из СписокКлиентов Цикл
		Строка = Объект.Список.Добавить();
		Строка.Контрагент = Клиент.Значение;
		Строка.НомерТелефона = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Клиент.Значение);
		Строка.Обработан = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
